Ubend0.2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            variableHeightFlowRateInletVelocity;
        flowRate        table
            (
			(0 0.0123)
			(1.0 0.0123)
			); 
        alpha           alpha.water;
        value           uniform (0 0 0); // placeholder
    }

    outlet
    {
        type           	inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    "(bottom|side)"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
