Ubend0.2/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    
    inlet
    {
        type            calculated;
        value           uniform 0;
    }


    outlet
    {
        type            calculated;
        value           uniform 0;
    }



    bottom
    {
    
        type            nutkRoughWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        Cs              uniform 0.5;
        Ks              uniform 0.000193;   // EM 1603 concrete (Q)
        value           uniform 0;
    }

    side
    {
    
        type            nutkRoughWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        Cs              uniform 0.5;
        Ks              uniform 0.0;
        value           uniform 0;
    }

    top
    {
        type            calculated;
        value           uniform 0;
    }


    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
