Ubend0.2/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

origin          (-41.5696 5.25 -0.5);

direction       (1 0 0);

waves
(
    Airy
    {
        length      10.0;
        amplitude   .25;
        phase       1.57;
        angle       0;
    }
);

UMean           (0.0 0 0);




// ************************************************************************* //
