Ubend0.2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices      //vertices of rectangular prism that encompasses flow volume 
(
    (290. 300. 50.)  //**modify**// vertex number 0 
    (3050.2 300. 50.)   //**modify**// vertex number 1 
    (3050.2 1500. 50.)  //**modify**// vertex number 2
    (290. 1500. 50.) //**modify**// vertex number 3
    (290. 300. 159.)  //**modify**// vertex number 4
    (3050.2 300. 159.)   //**modify**// vertex number 5
    (3050.2 1500. 159.)  //**modify**// vertex number 6
    (290. 1500. 159.) //**modify**// vertex number 7
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   // vertex numbers 
    (1264 550 50)              //**modify**// numbers of cells in each direction//
    simpleGrading (1 1 1)   // cell expansion ratios 
);

edges
(
);

boundary
(
    face1
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    face2
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    face3
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    face4
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    front
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
