Ubend0.2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          0.0001;

writeControl    adjustableRunTime;

myWriteInterval 0.4; // Define the value here

writeInterval   $myWriteInterval;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           1.0;
maxAlphaCo      1.0;

maxDeltaT       1;

/*
OptimisationSwitches
{
fileHandler collated;
maxThreadFileBufferSize 2e9;
}
*/

//stopAt   noWriteNow;


functions
{

    isosurfaceAlphaWater
    {
        type            surfaces;
        functionObjectLibs ("libsampling.so");
        outputControl   adjustableRunTime;
        outputInterval  $myWriteInterval; // write every time step

        surfaceFormat   vtk; // choose the desired format (e.g., vtk, ensight, etc.)

        fields
        (
            alpha.water
        );

        surfaces
        (
            isoSurface1
            {
                type        isoSurface;
                isoField    alpha.water;
                isoValue    0.5;
                interpolate true;
            }
        );
    }



wallShearStress1
{
    // Mandatory entries (unmodifiable)
    type            wallShearStress;
    libs            (fieldFunctionObjects);

    // Optional entries (runtime modifiable)
    patches         ("(bottom|side)"); 

    // Optional (inherited) entries
    writePrecision  8;
    writeToFile     true;
    useUserTime     true;
    region          region0;
    enabled         true;
    log             true;
    executeControl  writeTime;
    executeInterval 1;
    writeControl    outputTime;
    writeInterval   1;
}

    yPlusCalculation
    {
        type            yPlusRAS;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1; // Adjust as needed, e.g., to match your other output intervals
        log             true;
        patches         ("(bottom|side)"); // List of patches where you want to calculate y+
        result          yPlus; // Name of the resulting field
        executeControl  writeTime;
        executeInterval 1;
        writeControl    outputTime;
        writeInterval   1;
    }


    SideWallShearStress
    {
        type            surfaceFieldValue;
        libs            ("libutilityFunctionObjects.so");

        fields          (wallShearStress);
        operation       areaIntegrate;
        regionType      patch;
        name            side; // Change this to the name of your surface/patch

        // Optional entries
        surfaceFormat   none;
        writeFields     true;
        enabled         true;
        log             true;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    outputTime;
        writeInterval   1;
    }

    BottomWallShearStress
    {
        type            surfaceFieldValue;
        libs            ("libutilityFunctionObjects.so");

        fields          (wallShearStress);
        operation       areaIntegrate;
        regionType      patch;
        name            bottom; // Change this to the name of your surface/patch

        // Optional entries
        surfaceFormat   none;
        writeFields     true;
        enabled         true;
        log             true;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    outputTime;
        writeInterval   1;
    }
averagedWallShearStress2
{
    // Mandatory entries (unmodifiable)
    type            surfaceFieldValue;
    libs            ("libutilityFunctionObjects.so");

    // Mandatory entries (runtime modifiable)
    fields          (wallShearStress);
    operation       areaAverage;
    regionType      patch;
    name            side;

    // Optional entries (runtime modifiable)
    //postOperation   none;
    //weightField     alpha1;
    //scaleFactor     1.0;
    //writeArea       false;
    surfaceFormat   none;

    // Optional (inherited) entries
    writeFields     true;
    //scalingFactor   1.0;
    //writePrecision  8;
    //writeToFile     true;
    //useUserTime     true;
    //region          region0;
    //enabled         true;
    //log             true;
    // timeStart       0;
    // timeEnd         1000;
    executeControl  writeTime;
    executeInterval 1;
    writeControl    outputTime;
    writeInterval   1;
}

    forces
    {
        type            forces;
        libs            ("libforces.so");
        executeControl  writeTime;
        executeInterval 1;
        writeControl    outputTime;
        writeInterval   1;
        log             true;

        patches         ("bottom"); // List of patches where you want to calculate forces

        rho             rhoInf; // Density, use "rhoInf" for incompressible flows
        rhoInf          1000;   // Fluid density (e.g., 1000 for water)

        CofR            (0 0 0); // Center of rotation for moment calculations, adjust as needed
    }

multiplyU
{
    // Mandatory entries (unmodifiable)
    type    multiply;
    libs    (fieldFunctionObjects);

    // Mandatory (inherited) entry (runtime modifiable)
    fields  (U alpha.water);

    // Optional (inherited) entries
    result          multU;
    enabled         true;
    log             true;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    adjustableRunTime;
    writeInterval   $myWriteInterval;
    purgeWrite      3;
}

multiplyP
{
    // Mandatory entries (unmodifiable)
    type    multiply;
    libs    (fieldFunctionObjects);

    // Mandatory (inherited) entry (runtime modifiable)
    fields  (p alpha.water);

    // Optional (inherited) entries
    result          multP;
    enabled         true;
    log             true;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    adjustableRunTime;
    writeInterval   $myWriteInterval;
    purgeWrite      3;
}


    surfaceIntegrate
    {
        type            surfaceFieldValue;
        libs ("libfieldFunctionObjects.so");
        enabled         true;
        executeControl  adjustableRunTime;
        executeInterval $myWriteInterval;
        writeControl    adjustableRunTime;
        writeInterval   $myWriteInterval;
        log             true;

        surfaceFormat   none; // or any other preferred format

        regionType      sampledSurface; // Correct region type
        name            integratedSurface;
        writeFields     true;
        
        sampledSurfaceDict
        {
            type        sampledTriSurfaceMesh; // Correct type within sampledSurfaceDict
            surface     "integratedSurface.stl"; // Path to a simple, valid OBJ file
            source      cells;  // sample cells or boundaryFaces
        }

        fields
        (
            U
        );

        operation       areaIntegrate; // Can be sum, areaAverage, areaIntegrate, etc.
    }

streamLine1
{
    // Mandatory entries (unmodifiable)
    type            streamLine;
    libs            (fieldFunctionObjects);
    enabled         true;
    executeControl  adjustableRunTime;
    executeInterval $myWriteInterval;
    writeControl    adjustableRunTime;
    writeInterval   $myWriteInterval;
    log             true;
    // Mandatory entries (runtime modifiable)
    U               U;
    fields (U alpha.water);
    setFormat       vtk;
    direction       bidirectional;
    lifeTime        10000;
    cloud           particleTracks;
        seedSampleSet
        {
            type    triSurfaceMeshPointSet; // Specify that the seeds come from a surface
            source  sampledSurfaceDict;
            surface "integratedSurface.stl";
            axis z;
        }

    // Optional entries (runtime modifiable)
    //bounds          (-2.0 -100 -100)(2.0 100 100);
    trackLength     5.0;
    interpolationScheme cellPoint;

}
    streamlines
    {
        type            streamline;
        libs ("libfieldFunctionObjects.so");
        enabled         true;
        executeControl  adjustableRunTime;
        executeInterval $myWriteInterval;
        writeControl    adjustableRunTime;
        writeInterval   $myWriteInterval;
        log             true;
        

        seedSampleSet
        {
            type    triSurfaceMeshPointSet; // Specify that the seeds come from a surface
            source  sampledSurfaceDict;
            surface sampledTriSurfaceMesh;
            surfaceName "integratedSurface.stl"; // Use the same name as in surfaceIntegrate
        }
        fields          (U); // Use multiplyU as the velocity field
        setFormat       vtk;
    }
/////////////////
centerlineProbes
{
  type probes;
  functionObjectLibs ("libsampling.so");
  outputControl runTime;
  outputInterval 1;
  probeLocations
  (
(-0.882 -1.504 0.01)
(-0.88 -1.354 0.01)
(-0.877 -1.204 0.01)
(-0.877 -1.055 0.01)
(-0.878 -0.905 0.01)
(-0.879 -0.755 0.01)
(-0.88 -0.605 0.01)
(-0.881 -0.455 0.01)
(-0.882 -0.305 0.01)
(-0.88 -0.156 0.01)
(-0.867 -0.007 0.01)
(-0.84 0.141 0.01)
(-0.807 0.287 0.01)
(-0.748 0.422 0.01)
(-0.664 0.546 0.01)
(-0.562 0.655 0.01)
(-0.424 0.712 0.01)
(-0.279 0.745 0.01)
(-0.13 0.759 0.01)
(0.02 0.76 0.01)
(0.167 0.744 0.01)
(0.31 0.699 0.01)
(0.44 0.631 0.01)
(0.551 0.531 0.01)
(0.644 0.416 0.01)
(0.719 0.286 0.01)
(0.773 0.149 0.01)
(0.799 0.001 0.01)
(0.812 -0.148 0.01)
(0.819 -0.297 0.01)
(0.819 -0.447 0.01)
(0.817 -0.597 0.01)
(0.815 -0.747 0.01)
(0.814 -0.897 0.01)
(0.814 -1.047 0.01)
(0.814 -1.196 0.01)
(0.814 -1.346 0.01)
(0.814 -1.496 0.01)
(-0.882 -1.504 0.02)
(-0.88 -1.354 0.02)
(-0.877 -1.204 0.02)
(-0.877 -1.055 0.02)
(-0.878 -0.905 0.02)
(-0.879 -0.755 0.02)
(-0.88 -0.605 0.02)
(-0.881 -0.455 0.02)
(-0.882 -0.305 0.02)
(-0.88 -0.156 0.02)
(-0.867 -0.007 0.02)
(-0.84 0.141 0.02)
(-0.807 0.287 0.02)
(-0.748 0.422 0.02)
(-0.664 0.546 0.02)
(-0.562 0.655 0.02)
(-0.424 0.712 0.02)
(-0.279 0.745 0.02)
(-0.13 0.759 0.02)
(0.02 0.76 0.02)
(0.167 0.744 0.02)
(0.31 0.699 0.02)
(0.44 0.631 0.02)
(0.551 0.531 0.02)
(0.644 0.416 0.02)
(0.719 0.286 0.02)
(0.773 0.149 0.02)
(0.799 0.001 0.02)
(0.812 -0.148 0.02)
(0.819 -0.297 0.02)
(0.819 -0.447 0.02)
(0.817 -0.597 0.02)
(0.815 -0.747 0.02)
(0.814 -0.897 0.02)
(0.814 -1.047 0.02)
(0.814 -1.196 0.02)
(0.814 -1.346 0.02)
(0.814 -1.496 0.02)
(-0.882 -1.504 0.03)
(-0.88 -1.354 0.03)
(-0.877 -1.204 0.03)
(-0.877 -1.055 0.03)
(-0.878 -0.905 0.03)
(-0.879 -0.755 0.03)
(-0.88 -0.605 0.03)
(-0.881 -0.455 0.03)
(-0.882 -0.305 0.03)
(-0.88 -0.156 0.03)
(-0.867 -0.007 0.03)
(-0.84 0.141 0.03)
(-0.807 0.287 0.03)
(-0.748 0.422 0.03)
(-0.664 0.546 0.03)
(-0.562 0.655 0.03)
(-0.424 0.712 0.03)
(-0.279 0.745 0.03)
(-0.13 0.759 0.03)
(0.02 0.76 0.03)
(0.167 0.744 0.03)
(0.31 0.699 0.03)
(0.44 0.631 0.03)
(0.551 0.531 0.03)
(0.644 0.416 0.03)
(0.719 0.286 0.03)
(0.773 0.149 0.03)
(0.799 0.001 0.03)
(0.812 -0.148 0.03)
(0.819 -0.297 0.03)
(0.819 -0.447 0.03)
(0.817 -0.597 0.03)
(0.815 -0.747 0.03)
(0.814 -0.897 0.03)
(0.814 -1.047 0.03)
(0.814 -1.196 0.03)
(0.814 -1.346 0.03)
(0.814 -1.496 0.03)
(-0.882 -1.504 0.04)
(-0.88 -1.354 0.04)
(-0.877 -1.204 0.04)
(-0.877 -1.055 0.04)
(-0.878 -0.905 0.04)
(-0.879 -0.755 0.04)
(-0.88 -0.605 0.04)
(-0.881 -0.455 0.04)
(-0.882 -0.305 0.04)
(-0.88 -0.156 0.04)
(-0.867 -0.007 0.04)
(-0.84 0.141 0.04)
(-0.807 0.287 0.04)
(-0.748 0.422 0.04)
(-0.664 0.546 0.04)
(-0.562 0.655 0.04)
(-0.424 0.712 0.04)
(-0.279 0.745 0.04)
(-0.13 0.759 0.04)
(0.02 0.76 0.04)
(0.167 0.744 0.04)
(0.31 0.699 0.04)
(0.44 0.631 0.04)
(0.551 0.531 0.04)
(0.644 0.416 0.04)
(0.719 0.286 0.04)
(0.773 0.149 0.04)
(0.799 0.001 0.04)
(0.812 -0.148 0.04)
(0.819 -0.297 0.04)
(0.819 -0.447 0.04)
(0.817 -0.597 0.04)
(0.815 -0.747 0.04)
(0.814 -0.897 0.04)
(0.814 -1.047 0.04)
(0.814 -1.196 0.04)
(0.814 -1.346 0.04)
(0.814 -1.496 0.04)
  );
  fields
  (
    multU
    multP
  );
}
slice_probes37
{
  type probes;
  functionObjectLibs ("libsampling.so");
  outputControl runTime;
  outputInterval 1;
  probeLocations
  (
(0.32727 0.2466 0.01)
(0.32727 0.2466 0.00)
(0.34854 0.26263 0.00)
(0.34854 0.26263 0.01)
(0.35151 0.26487 0.01)
(0.35151 0.26487 0.00)
(0.37576 0.28313 0.00)
(0.37576 0.28313 0.01)
(0.39144 0.29495 0.00)
(0.39144 0.29495 0.01)
(0.4 0.3014 0.01)
(0.4 0.3014 0.00)
(0.42424 0.31967 0.00)
(0.42424 0.31967 0.01)
(0.43434 0.32727 0.00)
(0.43434 0.32727 0.01)
(0.44848 0.33793 0.01)
(0.44848 0.33793 0.00)
(0.47273 0.3562 0.00)
(0.47273 0.3562 0.01)
(0.47723 0.3596 0.00)
(0.47723 0.3596 0.01)
(0.49697 0.37447 0.01)
(0.49697 0.37447 0.00)
(0.52013 0.39192 0.00)
(0.52013 0.39192 0.01)
(0.52121 0.39273 0.01)
(0.52121 0.39273 0.00)
(0.54545 0.411 0.00)
(0.54545 0.411 0.01)
(0.56303 0.42424 0.00)
(0.56303 0.42424 0.01)
(0.5697 0.42927 0.01)
(0.5697 0.42927 0.00)
(0.59394 0.44753 0.00)
(0.59394 0.44753 0.01)
(0.60593 0.45656 0.00)
(0.60593 0.45656 0.01)
(0.61818 0.4658 0.01)
(0.61818 0.4658 0.00)
(0.64242 0.48407 0.00)
(0.64242 0.48407 0.01)
(0.64882 0.48889 0.00)
(0.64882 0.48889 0.01)
(0.66667 0.50233 0.01)
(0.66667 0.50233 0.00)
(0.69091 0.5206 0.00)
(0.69091 0.5206 0.01)
(0.69172 0.52121 0.00)
(0.69172 0.52121 0.01)
(0.71515 0.53887 0.01)
(0.71515 0.53887 0.00)
(0.73462 0.55353 0.00)
(0.73462 0.55353 0.01)
(0.73939 0.55713 0.01)
(0.73939 0.55713 0.00)
(0.76364 0.5754 0.00)
(0.76364 0.5754 0.01)
(0.77752 0.58586 0.00)
(0.77752 0.58586 0.01)
(0.78788 0.59367 0.01)
(0.78788 0.59367 0.00)
(0.81212 0.61193 0.00)
(0.81212 0.61193 0.01)
(0.82041 0.61818 0.00)
(0.82041 0.61818 0.01)
(0.83636 0.6302 0.01)
(0.83636 0.6302 0.00)
(0.86061 0.64847 0.00)
(0.86061 0.64847 0.01)
(0.86331 0.6505 0.00)
(0.86331 0.6505 0.01)
(0.88485 0.66673 0.01)
(0.88485 0.66673 0.00)
(0.90621 0.68283 0.00)
(0.90621 0.68283 0.01)
(0.90909 0.685 0.01)
(0.90909 0.685 0.00)
(0.93333 0.70327 0.00)
(0.93333 0.70327 0.01)
(0.9491 0.71515 0.00)
(0.9491 0.71515 0.01)
(0.32727 0.2466 0.01)
(0.34854 0.26263 0.01)
(0.35151 0.26487 0.01)
(0.37576 0.28313 0.01)
(0.39144 0.29495 0.01)
(0.4 0.3014 0.01)
(0.42424 0.31967 0.01)
(0.43434 0.32727 0.01)
(0.44848 0.33793 0.01)
(0.47273 0.3562 0.01)
(0.47723 0.3596 0.01)
(0.49697 0.37447 0.01)
(0.52013 0.39192 0.01)
(0.52121 0.39273 0.01)
(0.54545 0.411 0.01)
(0.56303 0.42424 0.01)
(0.5697 0.42927 0.01)
...
  );
  fields
  (
    multU
    multP
  );
}
slice_probes103
{
  type probes;
  functionObjectLibs ("libsampling.so");
  outputControl runTime;
  outputInterval 1;
  probeLocations
  (
(-0.084848 0.39913 0.00)
(-0.084848 0.39913 0.01)
(-0.090187 0.42424 0.01)
(-0.090187 0.42424 0.00)
(-0.097059 0.45656 0.00)
(-0.097059 0.45656 0.01)
(-0.10393 0.48889 0.00)
(-0.10393 0.48889 0.01)
(-0.10909 0.51316 0.00)
(-0.10909 0.51316 0.01)
(-0.1108 0.52121 0.01)
(-0.1108 0.52121 0.00)
(-0.11767 0.55353 0.00)
(-0.11767 0.55353 0.01)
(-0.12454 0.58586 0.00)
(-0.12454 0.58586 0.01)
(-0.13142 0.61818 0.00)
(-0.13142 0.61818 0.01)
(-0.13333 0.6272 0.00)
(-0.13333 0.6272 0.01)
(-0.13829 0.6505 0.01)
(-0.13829 0.6505 0.00)
(-0.14516 0.68283 0.00)
(-0.14516 0.68283 0.01)
(-0.15203 0.71515 0.00)
(-0.15203 0.71515 0.01)
(-0.15758 0.74124 0.00)
(-0.15758 0.74124 0.01)
(-0.1589 0.74747 0.01)
(-0.1589 0.74747 0.00)
(-0.16577 0.7798 0.00)
(-0.16577 0.7798 0.01)
(-0.17264 0.81212 0.00)
(-0.17264 0.81212 0.01)
(-0.17952 0.84444 0.00)
(-0.17952 0.84444 0.01)
(-0.18182 0.85527 0.00)
(-0.18182 0.85527 0.01)
(-0.18639 0.87677 0.01)
(-0.18639 0.87677 0.00)
(-0.19326 0.90909 0.00)
(-0.19326 0.90909 0.01)
(-0.20013 0.94141 0.00)
(-0.20013 0.94141 0.01)
(-0.20606 0.96931 0.00)
(-0.20606 0.96931 0.01)
(-0.207 0.97374 0.01)
(-0.207 0.97374 0.00)
(-0.21387 1.0061 0.00)
(-0.21387 1.0061 0.01)
(-0.22074 1.0384 0.00)
(-0.22074 1.0384 0.01)
(-0.22762 1.0707 0.00)
(-0.22762 1.0707 0.01)
(-0.2303 1.0833 0.00)
(-0.2303 1.0833 0.01)
(-0.23449 1.103 0.01)
(-0.23449 1.103 0.00)
(-0.24136 1.1354 0.00)
(-0.24136 1.1354 0.01)
(-0.24823 1.1677 0.00)
(-0.24823 1.1677 0.01)
(-0.084848 0.39913 0.01)
(-0.090187 0.42424 0.01)
(-0.097059 0.45656 0.01)
(-0.10393 0.48889 0.01)
(-0.10909 0.51316 0.01)
(-0.1108 0.52121 0.01)
(-0.11767 0.55353 0.01)
(-0.12454 0.58586 0.01)
(-0.13142 0.61818 0.01)
(-0.13333 0.6272 0.01)
(-0.13829 0.6505 0.01)
(-0.14516 0.68283 0.01)
(-0.15203 0.71515 0.01)
(-0.15758 0.74124 0.01)
(-0.1589 0.74747 0.01)
(-0.16577 0.7798 0.01)
(-0.17264 0.81212 0.01)
(-0.17952 0.84444 0.01)
(-0.18182 0.85527 0.01)
(-0.18639 0.87677 0.01)
(-0.19326 0.90909 0.01)
(-0.20013 0.94141 0.01)
(-0.20606 0.96931 0.01)
(-0.207 0.97374 0.01)
(-0.21387 1.0061 0.01)
(-0.22074 1.0384 0.01)
(-0.22762 1.0707 0.01)
(-0.2303 1.0833 0.01)
(-0.23449 1.103 0.01)
(-0.24136 1.1354 0.01)
(-0.24823 1.1677 0.01)
(-0.084848 0.39913 0.02)
(-0.090187 0.42424 0.02)
(-0.097059 0.45656 0.02)
(-0.10393 0.48889 0.02)
(-0.10909 0.51316 0.02)
(-0.1108 0.52121 0.02)
...
  );
  fields
  (
    multU
    multP
  );
}
downstream0p5_slice_probes
{
  type probes;
  functionObjectLibs ("libsampling.so");
  outputControl runTime;
  outputInterval 1;
  probeLocations
  (
(-1.1758 -0.5 0.00)
(-1.1758 -0.5 0.01)
(-1.2 -0.5 0.00)
(-1.2 -0.5 0.01)
(-1.1515 -0.5 0.00)
(-1.1515 -0.5 0.01)
(-1.1273 -0.5 0.00)
(-1.1273 -0.5 0.01)
(-1.103 -0.5 0.00)
(-1.103 -0.5 0.01)
(-1.0788 -0.5 0.00)
(-1.0788 -0.5 0.01)
(-1.0545 -0.5 0.00)
(-1.0545 -0.5 0.01)
(-1.0303 -0.5 0.00)
(-1.0303 -0.5 0.01)
(-1.0061 -0.5 0.00)
(-1.0061 -0.5 0.01)
(-0.98182 -0.5 0.00)
(-0.98182 -0.5 0.01)
(-0.95757 -0.5 0.00)
(-0.95757 -0.5 0.01)
(-0.93333 -0.5 0.00)
(-0.93333 -0.5 0.01)
(-0.90909 -0.5 0.00)
(-0.90909 -0.5 0.01)
(-0.88485 -0.5 0.00)
(-0.88485 -0.5 0.01)
(-0.86061 -0.5 0.00)
(-0.86061 -0.5 0.01)
(-0.83636 -0.5 0.00)
(-0.83636 -0.5 0.01)
(-0.81212 -0.5 0.00)
(-0.81212 -0.5 0.01)
(-0.78788 -0.5 0.00)
(-0.78788 -0.5 0.01)
(-0.76364 -0.5 0.00)
(-0.76364 -0.5 0.01)
(-0.73939 -0.5 0.00)
(-0.73939 -0.5 0.01)
(-0.71515 -0.5 0.00)
(-0.71515 -0.5 0.01)
(-0.69091 -0.5 0.00)
(-0.69091 -0.5 0.01)
(-0.66667 -0.5 0.00)
(-0.66667 -0.5 0.01)
(-0.64242 -0.5 0.00)
(-0.64242 -0.5 0.01)
(-0.61818 -0.5 0.00)
(-0.61818 -0.5 0.01)
(-0.59394 -0.5 0.00)
(-0.59394 -0.5 0.01)
(-0.5697 -0.5 0.00)
(-0.5697 -0.5 0.01)
(-0.54545 -0.5 0.00)
(-0.54545 -0.5 0.01)
(-0.52121 -0.5 0.00)
(-0.52121 -0.5 0.01)
(-0.49697 -0.5 0.00)
(-0.49697 -0.5 0.01)
(-0.47273 -0.5 0.00)
(-0.47273 -0.5 0.01)
(-0.44848 -0.5 0.00)
(-0.44848 -0.5 0.01)
(-0.42424 -0.5 0.00)
(-0.42424 -0.5 0.01)
(-1.1758 -0.5 0.01)
(-1.2 -0.5 0.01)
(-1.1515 -0.5 0.01)
(-1.1273 -0.5 0.01)
(-1.103 -0.5 0.01)
(-1.0788 -0.5 0.01)
(-1.0545 -0.5 0.01)
(-1.0303 -0.5 0.01)
(-1.0061 -0.5 0.01)
(-0.98182 -0.5 0.01)
(-0.95757 -0.5 0.01)
(-0.93333 -0.5 0.01)
(-0.90909 -0.5 0.01)
(-0.88485 -0.5 0.01)
(-0.86061 -0.5 0.01)
(-0.83636 -0.5 0.01)
(-0.81212 -0.5 0.01)
(-0.78788 -0.5 0.01)
(-0.76364 -0.5 0.01)
(-0.73939 -0.5 0.01)
(-0.71515 -0.5 0.01)
(-0.69091 -0.5 0.01)
(-0.66667 -0.5 0.01)
(-0.64242 -0.5 0.01)
(-0.61818 -0.5 0.01)
(-0.59394 -0.5 0.01)
(-0.5697 -0.5 0.01)
(-0.54545 -0.5 0.01)
(-0.52121 -0.5 0.01)
(-0.49697 -0.5 0.01)
(-0.47273 -0.5 0.01)
(-0.44848 -0.5 0.01)
(-0.42424 -0.5 0.01)
...
  );
  fields
  (
    multU
    multP
  );
}
pressure
    {
        type           pressure; 
        functionObjectLibs ("libfieldFunctionObjects.so");
        writeControl    outputTime;
        rho     rho; 
        pRef    0;
        calcTotal   yes;
        calcCoeff   no;
  }


   minmaxdomain
    {
        type fieldMinMax;
        libs ("libfieldFunctionObjects.so");
        enabled true;
        mode component;
        writeControl timeStep;
        writeInterval 1;
        log true;
        fields (p U k epsilon nut);
    }




} 





// ************************************************************************* //
