Ubend0.2/system/extrudeMeshDict.txt
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrude2DMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

extrudeModel        linearDirection;

patchInfo
{}

patchType           empty;

nLayers             1;

expansionRatio      1.0;

linearDirectionCoeffs
{
    direction       (0 0 1);
    thickness       0.1;
}

wedgeCoeffs
{
    axisPt          (0 0 0);
    axis            (1 0 0);
    angle           10;
}


// ************************************************************************* //