Ubend0.2/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes {default CrankNicolson 0.2;}

gradSchemes {default cellLimited Gauss linear 1;}

divSchemes
{
    div(rhoPhi,U) Gauss linearUpwindV cellLimited Gauss linear 1; //Gauss linearUpwindV cellLimited Gauss linear 1;
    div(phi,alpha) Gauss vanLeer; //Gauss vanLeer; //Gauss vanLeer;
    div(phirb,alpha) Gauss interfaceCompression 1;
    div(phi,p_rgh) Gauss linearUpwind;  //Gauss linearUpwind;
    div(phi,k) Gauss vanLeer; //Gauss vanLeer;//vanLeer;
    div(phi,epsilon) Gauss vanLeer; //Gauss vanLeer;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,omega) Gauss upwind;
}

laplacianSchemes {default Gauss linear limited 0.5;}

interpolationSchemes {default linear;}

snGradSchemes {default limited 0.5;}

fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
    gamma;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
